#pragma once

// CROWZ (0.X) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "CROWZ_CrowFPS_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class CrowFPS.BTDecorator_CrowCooldown
// 0x0008 (0x0078 - 0x0070)
class UBTDecorator_CrowCooldown : public UBTDecorator_Cooldown
{
public:
	bool                                               ResetCooldownTimeOnInitialize;                            // 0x0070(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0071(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTDecorator_CrowCooldown"));
		return ptr;
	}

};


// Class CrowFPS.CrowCharacterBTServiceBase
// 0x0000 (0x0098 - 0x0098)
class UCrowCharacterBTServiceBase : public UBTService_BlackboardBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowCharacterBTServiceBase"));
		return ptr;
	}

};


// Class CrowFPS.BTService_CrowFindTarget
// 0x0028 (0x00C0 - 0x0098)
class UBTService_CrowFindTarget : public UCrowCharacterBTServiceBase
{
public:
	struct FBlackboardKeySelector                      TargetInSight;                                            // 0x0098(0x0028) (CPF_Edit, CPF_Protected, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTService_CrowFindTarget"));
		return ptr;
	}

};


// Class CrowFPS.BTService_CrowLookAtTarget
// 0x0000 (0x0098 - 0x0098)
class UBTService_CrowLookAtTarget : public UCrowCharacterBTServiceBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTService_CrowLookAtTarget"));
		return ptr;
	}

};


// Class CrowFPS.BTService_CrowTestAction
// 0x0000 (0x0098 - 0x0098)
class UBTService_CrowTestAction : public UCrowCharacterBTServiceBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTService_CrowTestAction"));
		return ptr;
	}

};


// Class CrowFPS.BTService_CrowUpdateTargetState
// 0x0028 (0x00C0 - 0x0098)
class UBTService_CrowUpdateTargetState : public UCrowCharacterBTServiceBase
{
public:
	struct FBlackboardKeySelector                      TargetInSight;                                            // 0x0098(0x0028) (CPF_Edit, CPF_Protected, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTService_CrowUpdateTargetState"));
		return ptr;
	}

};


// Class CrowFPS.CrowCharacterBTTaskBase
// 0x0000 (0x0098 - 0x0098)
class UCrowCharacterBTTaskBase : public UBTTask_BlackboardBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowCharacterBTTaskBase"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowCheckTargetInSight
// 0x0000 (0x0098 - 0x0098)
class UBTTask_CrowCheckTargetInSight : public UCrowCharacterBTTaskBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowCheckTargetInSight"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowFindCoverPoint
// 0x0008 (0x00A0 - 0x0098)
class UBTTask_CrowFindCoverPoint : public UCrowCharacterBTTaskBase
{
public:
	ECrowAIFindCoverPointMode                          FindMode;                                                 // 0x0098(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0099(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowFindCoverPoint"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowFindRandomPatrol
// 0x0008 (0x00A0 - 0x0098)
class UBTTask_CrowFindRandomPatrol : public UCrowCharacterBTTaskBase
{
public:
	float                                              PatrolRadius;                                             // 0x0098(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x4];                                       // 0x009C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowFindRandomPatrol"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowFindTarget
// 0x0000 (0x0098 - 0x0098)
class UBTTask_CrowFindTarget : public UCrowCharacterBTTaskBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowFindTarget"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowFireTarget
// 0x0010 (0x00A8 - 0x0098)
class UBTTask_CrowFireTarget : public UCrowCharacterBTTaskBase
{
public:
	float                                              FireTime;                                                 // 0x0098(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              CoolDownTime;                                             // 0x009C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              CooldownRandomDeviation;                                  // 0x00A0(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowFireTarget"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowMoveTo
// 0x0008 (0x00B8 - 0x00B0)
class UBTTask_CrowMoveTo : public UBTTask_MoveTo
{
public:
	ECrowAICharacterStance                             Stance;                                                   // 0x00B0(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	ECrowAICharacterMoveMode                           MoveMode;                                                 // 0x00B1(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x6];                                       // 0x00B2(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowMoveTo"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowOccupyCoverPoint
// 0x0008 (0x00C0 - 0x00B8)
class UBTTask_CrowOccupyCoverPoint : public UBTTask_CrowMoveTo
{
public:
	ECrowAIFindCoverPointMode                          FindMode;                                                 // 0x00B8(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00B9(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowOccupyCoverPoint"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowSetBlackboardBool
// 0x0008 (0x00A0 - 0x0098)
class UBTTask_CrowSetBlackboardBool : public UCrowCharacterBTTaskBase
{
public:
	bool                                               IsSet;                                                    // 0x0098(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0099(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowSetBlackboardBool"));
		return ptr;
	}

};


// Class CrowFPS.BTTask_CrowSetStance
// 0x0008 (0x00A0 - 0x0098)
class UBTTask_CrowSetStance : public UCrowCharacterBTTaskBase
{
public:
	ECrowAICharacterStance                             Stance;                                                   // 0x0098(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	ECrowAICharacterMoveMode                           MoveMode;                                                 // 0x0099(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x6];                                       // 0x009A(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.BTTask_CrowSetStance"));
		return ptr;
	}

};


// Class CrowFPS.CrowActorComponentBase
// 0x0010 (0x00C0 - 0x00B0)
class UCrowActorComponentBase : public UActorComponent
{
public:
	class UCrowComponentContainer*                     OwnerContainer;                                           // 0x00B0(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class AActor*                                      CrowComponentOwnerActor;                                  // 0x00B8(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowActorComponentBase"));
		return ptr;
	}


	void SetOwnerContainer(class UCrowComponentContainer* ComponentContainer, class AActor* OwnerActor);
	class UClass* /* UObject*/ BNE_GetCrowComponentType();
};


// Class CrowFPS.CrowActorComponentBreakableMesh
// 0x0010 (0x0210 - 0x0200)
class UCrowActorComponentBreakableMesh : public USceneComponent
{
public:
	class UStaticMeshComponent*                        SM_Broken;                                                // 0x0200(0x0008) (CPF_Edit, CPF_ExportObject, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                        SM_CustomDepth;                                           // 0x0208(0x0008) (CPF_Edit, CPF_ExportObject, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowActorComponentBreakableMesh"));
		return ptr;
	}

};


// Class CrowFPS.CrowActorInitializerBase
// 0x0010 (0x00C0 - 0x00B0)
class UCrowActorInitializerBase : public UActorComponent
{
public:
	class AActor*                                      TargetActor;                                              // 0x00B0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowComponentContainer*                     ComponentContainer;                                       // 0x00B8(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowActorInitializerBase"));
		return ptr;
	}


	static class UCrowActorInitializerBase* SafeNewInitializer(class AActor* TargetActor, class UClass* /* UObject*/ Class);
};


// Class CrowFPS.CrowWidgetBase
// 0x00E8 (0x0348 - 0x0260)
class UCrowWidgetBase : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0260(0x0008) MISSED OFFSET
	class UCrowWidgetBase*                             EventHandler;                                             // 0x0268(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UClass* /* UCrowWidgetBase*/                 EventHandlerWidgetType;                                   // 0x0270(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FString                                     HandlerWidgetName;                                        // 0x0278(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	ECrowEvent                                         Event;                                                    // 0x0288(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0288(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData02[0x4];                                       // 0x028C(0x0004) MISSED OFFSET
	class UAkAudioEvent*                               VisibleSound;                                             // 0x0290(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UAkAudioEvent*                               InvisibleSound;                                           // 0x0298(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	TMap<struct FName, class UWidgetAnimation*>        AnimationsMap;                                            // 0x02A0(0x0050) (CPF_Transient, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData03[0x10];                                      // 0x02F0(0x0010) MISSED OFFSET
	TArray<class UCrowWidgetTweenBase*>                TweenerArray;                                             // 0x0300(0x0010) (CPF_ZeroConstructor, CPF_Transient, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	class UCrowWidgetManager*                          WidgetManager;                                            // 0x0310(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowWidgetBase*                             MasterWidget;                                             // 0x0318(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData04[0x28];                                      // 0x0320(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowWidgetBase"));
		return ptr;
	}


	void OnPlayAkAudio(class UAkAudioEvent* AudioEvent);
	void OnFadeOutComplete();
	void OnFadeInComplete();
	class ACrowPlayerControllerBase* GetCrowPlayerController();
	class UCrowGameInstance* GetCrowGameInstance();
	class ACrowCharacterPawn* GetCrowCharacterPawn();
	void Close();
};


// Class CrowFPS.CrowActorRotatorWidget
// 0x0028 (0x0370 - 0x0348)
class UCrowActorRotatorWidget : public UCrowWidgetBase
{
public:
	bool                                               bIsRotateHorizontal;                                      // 0x0348(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bIsRotateVertical;                                        // 0x0349(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bInverseHorizontal;                                       // 0x034A(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bInversVertical;                                          // 0x034B(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x4];                                       // 0x034C(0x0004) MISSED OFFSET
	class AActor*                                      TargetActor;                                              // 0x0350(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0358(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowActorRotatorWidget"));
		return ptr;
	}

};


// Class CrowFPS.CrowAICharacterController
// 0x00E0 (0x0408 - 0x0328)
class ACrowAICharacterController : public AAIController
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0328(0x0028) MISSED OFFSET
	struct FCrowAICharacterData                        Setup_AICharacterData;                                    // 0x0350(0x0060) (CPF_Edit, CPF_DisableEditOnInstance, CPF_NativeAccessSpecifierPublic)
	struct FCrowAICharacterParameter                   Setup_AICharacterParameter;                               // 0x03B0(0x0020) (CPF_Edit, CPF_DisableEditOnInstance, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)
	struct FCrowAIFireTargetData                       Setup_AIFireTargetData;                                   // 0x03D0(0x0018) (CPF_Edit, CPF_DisableEditOnInstance, CPF_NativeAccessSpecifierPublic)
	class ACrowAICharacterPawn*                        AIPawn;                                                   // 0x03E8(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class ACrowAICharacterSpawner*                     AISpawner;                                                // 0x03F0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FTimerHandle                                UpdateAIPerceptionTimerHandle;                            // 0x03F8(0x0008) (CPF_Transient, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bStartFire;                                               // 0x0400(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0401(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowAICharacterController"));
		return ptr;
	}


	void StopAnimNetworked(class UAnimMontage* AnimMontage, float BlendOut);
	void SetStance(ECrowAICharacterStance Instance);
	void SetMoveMode(ECrowAICharacterMoveMode InMoveMode);
	float PlayAnimNetworked(class UAnimMontage* AnimMontage, const struct FName& SectionName, float PlayRate, float StartPosition, bool bStopMontages);
	void OnTargetPerceptionUpdate(class AActor* InTarget, const struct FAIStimulus& InStimulus);
	bool IsAnyStanceChanging();
};


// Class CrowFPS.CrowAIObjectCharacterBase
// 0x0048 (0x0268 - 0x0220)
class ACrowAIObjectCharacterBase : public AActor
{
public:
	bool                                               bOverrideCrowAIObjectBillboardSprite;                     // 0x0220(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bOverrideCrowAIObjectCharacterMesh;                       // 0x0221(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bOverrideCrowAIObjectCharacterMeshMaterial;               // 0x0222(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bOverrideCrowAIObjectCharacterPreviewAnim;                // 0x0223(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0224(0x0004) MISSED OFFSET
	class UTexture2D*                                  OverrideCrowAIObjectBillboardSprite;                      // 0x0228(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class USkeletalMesh*                               OverrideCrowAIObjectCharacterMesh;                        // 0x0230(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UMaterialInterface*                          OverrideCrowAIObjectCharacterMeshMaterial;                // 0x0238(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UAnimSequenceBase*                           OverrideCrowAIObjectCharacterPreviewAnim;                 // 0x0240(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class USceneComponent*                             RootSceneComponent;                                       // 0x0248(0x0008) (CPF_Edit, CPF_ExportObject, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0250(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowAIObjectCharacterBase"));
		return ptr;
	}

};


// Class CrowFPS.CrowAICharacterCoverPoint
// 0x0028 (0x0290 - 0x0268)
class ACrowAICharacterCoverPoint : public ACrowAIObjectCharacterBase
{
public:
	class ACrowAICharacterPawn*                        OccupyedAICharacter;                                      // 0x0268(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               IsCollectable;                                            // 0x0270(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	ECrowAICharacterStance                             OccupyStance;                                             // 0x0271(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0272(0x0006) MISSED OFFSET
	class UAnimSequenceBase*                           PreviewAnimStand;                                         // 0x0278(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                           PreviewAnimCrouch;                                        // 0x0280(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                           PreviewAnimProne;                                         // 0x0288(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowAICharacterCoverPoint"));
		return ptr;
	}

};


// Class CrowFPS.CrowCharacterBase
// 0x00C0 (0x11B0 - 0x10F0)
class ACrowCharacterBase : public ACLSCharacter
{
public:
	struct FCrowCharacterAppearance                    ReplicatedAppearance;                                     // 0x10F0(0x0006) (CPF_Net, CPF_RepNotify, CPF_NoDestructor, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x2];                                       // 0x10F6(0x0002) MISSED OFFSET
	TArray<struct FCrowClothItemData>                  DefaultClothesList;                                       // 0x10F8(0x0010) (CPF_Net, CPF_ZeroConstructor, CPF_RepNotify, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	TArray<uint32_t>                                   DefaultTattooIndexList;                                   // 0x1108(0x0010) (CPF_Net, CPF_ZeroConstructor, CPF_RepNotify, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	uint32_t                                           DefaultResultMVPIndex;                                    // 0x1118(0x0004) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bIsHuman;                                                 // 0x111C(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x3];                                       // 0x111D(0x0003) MISSED OFFSET
	struct FName                                       PelvisBoneName;                                           // 0x1120(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              ElapsedForceSyncRotation;                                 // 0x1128(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      bIsWeaponFiring : 1;                                      // 0x112C(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_RepNotify, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData02[0x3];                                       // 0x112D(0x0003) MISSED OFFSET
	float                                              PronedEyeHeight;                                          // 0x1130(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData03[0x4];                                       // 0x1134(0x0004) MISSED OFFSET
	class UCrowCharacterMovement*                      CrowMovement;                                             // 0x1138(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowProneCapsuleComponent*                  ProneCollisionCapsuleComponent;                           // 0x1140(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowClothActorComponent*                    TP_ClothComponent;                                        // 0x1148(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FCrowCharacterAppearance                    CurrentAppearance;                                        // 0x1150(0x0006) (CPF_Edit, CPF_DisableEditOnInstance, CPF_NoDestructor, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData04[0x2];                                       // 0x1156(0x0002) MISSED OFFSET
	uint32_t                                           CurrentTattooFaceIndex;                                   // 0x1158(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	uint32_t                                           CurrentTattooArmIndex;                                    // 0x115C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UPhysicsAsset*                               CharacterPhysicsAsset;                                    // 0x1160(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UPhysicsAsset*                               RagdollPhysicsAsset;                                      // 0x1168(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowLibraryMergeSKCTask*                    MergeMeshTask;                                            // 0x1170(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData05[0x8];                                       // 0x1178(0x0008) MISSED OFFSET
	class USkeletalMesh*                               OptimizationWeaponMesh;                                   // 0x1180(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class USkeletalMesh*                               OptimizationCharacterMesh;                                // 0x1188(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class USkeletalMesh*                               BackupNoOptimizationCharacterMesh;                        // 0x1190(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UMaterialInterface*                          BackupNoOptimizationCharacterMaterial;                    // 0x1198(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	int                                                CacheMergedMeshIndex;                                     // 0x11A0(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData06[0x4];                                       // 0x11A4(0x0004) MISSED OFFSET
	class UClass* /* UObject*/                         BackupAnimClass;                                          // 0x11A8(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class CrowFPS.CrowCharacterBase"));
		return ptr;
	}


	void ServerMovePacked_CrowWorld(const struct FCharacterServerMovePackedBits& PackedBits, uint32_t WorldActorIndex, int16_t LayoutItemIndex);
	void Server_WeaponFiring(bool IsFiring);
	void OnRep_IsWeaponFiring();
	void OnRep_ChangeDefaultTattooIndexList();
	void OnRep_ChangeDefaultClothesList();
	void OnRep_ChangeAppearance();
	void OnCompleteMergedMeshTP(class USkeletalMesh* InMergedMesh);
	void Multicast_DrawDebugLine(const struct FVector& LineStart, const struct FVector& LineEnd, const struct FColor& LineColor);
	bool IsOnVault();
	bool IsOnInteract();
	bool IsMale();
	class UCrowClothActorComponent* GetTP_ClothComponent();
	struct FVector GetFireTargetPartOffset(ECrowCharacterFireTargetPart InPart);
};


// Class CrowFPS.CrowCharacterPawn
// 0x0960 (0x1B10 - 0x11B0)
class ACrowCharacterPawn : public ACrowCharacterBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x11B0(0x0010) MISSED OFFSET
	bool                                               bStopAdditionalCollision;                                 // 0x11C0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               bUseViewDependsOnManager;                                 // 0x11C1(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x4E];                                      // 0x11C2(0x004E) MISSED OFFSET
	class ACrowPlayerStateBase*                        SavedPlayerState;                                         // 0x1210(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData02[0x4];                                       // 0x1218(0x0004) MISSED OFFSET
	struct FVector                                     ServerHeadLocation;                                       // 0x121C(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bEnableDrownedMoving;                                     // 0x1228(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData03[0x3];                                       // 0x1229(0x0003) MISSED OFFSET
	struct FName                                       HeadCollisionSocketName;                                  // 0x122C(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FName                                       NeckBoneName;                                             // 0x1234(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              SprintingAngleLimit;                                      // 0x123C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FName                                       CamSocketName;                                            // 0x1240(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              TurnOffsetTest;                                           // 0x1248(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FCrowCharacterLookLimitStance               LimitControlRotation;                                     // 0x124C(0x00AC) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_DisableEditOnInstance, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)
	struct FCrowCharacterLookLimitStance               LimitAimOffset;                                           // 0x12F8(0x00AC) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_DisableEditOnInstance, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)
	float                                              ProneLimitCheckDistance;                                  // 0x13A4(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              ProneLimitCheckRadius;                                    // 0x13A8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              ProneLimitFrontBackVelocityFactor;                        // 0x13AC(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              ProneLimitSideVelocityFactor;                             // 0x13B0(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              ProneLimitNotMovingBaseLength;                            // 0x13B4(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              ProneLimitNotMovingCheckDistance;                         // 0x13B8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData04[0x4];                                       // 0x13BC(0x0004) MISSED OFFSET
	class ACrowVehiclePawn*                            ReservedVehicle;                                          // 0x13C0(0x0008) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               bIsReservedVehicle;                                       // 0x13C8(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData05[0x7];                                       // 0x13C9(0x0007) MISSED OFFSET
	class ACrowVehiclePawn*                            BoardingVehicle;                                          // 0x13D0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FName                                       VehicleName;                                              // 0x13D8(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      SeatIndex;                                                // 0x13E0(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	EVehicleSeatType                                   SeatType;                                                 // 0x13E1(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData06[0x2];                                       // 0x13E2(0x0002) MISSED OFFSET
	float                                              SeatLeanForward;                                          // 0x13E4(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              SeatLeanBackward;                                         // 0x13E8(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              SeatLeanSide;                                             // 0x13EC(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              ProneAddedPitchValue;                                     // 0x13F0(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FRotator                                    DefaultVehicleControlInput;                               // 0x13F4(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	struct FVector2D                                   VehicleControlPitchMinMax;                                // 0x1400(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FVector2D                                   VehicleControlYawMinMax;                                  // 0x1408(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FVector2D                                   VehicleControlFirePitchMinMax;                            // 0x1410(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FVector2D                                   VehicleControlFireYawMinMax;                              // 0x1418(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCapsuleComponent*                           PickupItemChecker;                                        // 0x1420(0x0008) (CPF_Edit, CPF_ExportObject, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              PickupItemCheckerSize;                                    // 0x1428(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData07[0x1];                                       // 0x142C(0x0001) MISSED OFFSET
	bool                                               IsPressUSEKey;                                            // 0x142D(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               IsPressSubUSEKey;                                         // 0x142E(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData08[0x9];                                       // 0x142F(0x0009) MISSED OFFSET
	class UCrowInputBase*                              InputDefault;                                             // 0x1438(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowInputBase*                              InputFindConstructionSite;                                // 0x1440(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowInputBase*                              InputConstruction;                                        // 0x1448(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowInputBase*                              InputUI;                                                  // 0x1450(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowInputBase*                              InputOnTablet;                                            // 0x1458(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	TArray<class ACrowItemBase*>                       NearItemList;                                             // 0x1460(0x0010) (CPF_ZeroConstructor, CPF_Transient, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	class UCrowTeleportationActorComponent*            CrowTeleportationActorComponent;                          // 0x1470(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowGasMaskComponent*                       CrowGasMaskComponent;                                     // 0x1478(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FCrowCharacterPeekSetup                     PeekSetup;                                                // 0x1480(0x0008) (CPF_Edit, CPF_DisableEditOnInstance, CPF_NoDestructor, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	bool                                               bIsLeftFoot;                                              // 0x1488(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bIsShootablePose;                                         // 0x1489(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData09[0x6];                                       // 0x148A(0x0006) MISSED OFFSET
	struct FVector                                     UpdatedAnimationPelvisOffset;                             // 0x1490(0x000C) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData10[0x10];                                      // 0x149C(0x0010) MISSED OFFSET
	float                                              AimDelayDefault;                                          // 0x14AC(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              AimDelaySlow;                                             // 0x14B0(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData11[0x4];                                       // 0x14B4(0x0004) MISSED OFFSET
	class UCrowLibraryMergeSKCTask*                    MergeMeshTask_FPArm;                                      // 0x14B8(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowLibraryMergeSKCTask*                    MergeMeshTask_FPBody;                                     // 0x14C0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bSkipOptimizationByScreensize;                            // 0x14C8(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData12[0x3];                                       // 0x14C9(0x0003) MISSED OFFSET
	ECrowConditionFlags                                CrowConditionFlags;                                       // 0x14CC(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData13[0x3];                                       // 0x14C9(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	bool                                               bIsSkydivingMode;                                         // 0x14D0(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData14[0x7];                                       // 0x14D1(0x0007) MISSED OFFSET
	class UCrowCharacterSkydivingComponent*            SkydivingComponent;                                       // 0x14D8(0x0008) (CPF_Edit, CPF_ExportObject, CPF_ZeroConstructor, CPF_EditConst, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bResetRelativeMeshTransform;                              // 0x14E0(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData15[0x7];                                       // 0x14E1(0x0007) MISSED OFFSET
	class UCrowWorldMapIcon*                           WorldMapIcon;                                             // 0x14E8(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UCrowIndicatorViewInfo*                      IndicatorInfo;                                            // 0x14F0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bIsSpectatorMode;                                         // 0x14F8(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bIsAimAtSpectatorMode;                                    // 0x14F9(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      SpectatorCameraMode;                                      // 0x14FA(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      PrevSpectatorCameraMode;                                  // 0x14FB(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData16[0x4];                                       // 0x14FC(0x0004) MISSED OFFSET
	struct FTimerHandle                                EndPlayEmotionTimerHandle;                                // 0x1500(0x0008) (CPF_Transient, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      PrevEmotionCameraMode;                                    // 0x1508(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               bIsPlayEmotion;                                           // 0x1509(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData17[0x2];                                       // 0x150A(0x0002) MISSED OFFSET
	uint32_t                                           CurrentEmotionIndex;                                      // 0x150C(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              SwimingOxygen;                                            // 0x1510(0x0004) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData18[0x4];                                       // 0x1514(0x0004) MISSED OFFSET
	class UCrowZombieComponent*                        ZombieComponent;                                          // 0x1518(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              MaxSwimingOxygen;                                         // 0x1520(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              ConsumeOxygen;                                            // 0x1524(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              ConsumeOxygenPerSecond;                                   // 0x1528(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              RecoveryOxygen;                                           // 0x152C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	float                                              RecoveryOxygenPerSecond;                                  // 0x1530(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
